---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DPartFailures.BindLinkWillDeleteAllPartsWarning
source: html/f67c1b29-c116-8d6c-0de9-d83ffa3ecdf2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DPartFailures.BindLinkWillDeleteAllPartsWarning Property

Bind Link will delete its associated Parts.

## Syntax (C#)
```csharp
public static FailureDefinitionId BindLinkWillDeleteAllPartsWarning { get; }
```